andrew-2.3.1/run/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/0.org/Su
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Su;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform 0.5;

boundaryField
{
    outer
    {
        type                uniformInletOutlet;
        uniformInletValue   0.5;
        value               uniform 0.5;
    }
    ground
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
    }
    baffleWall
    {
        type            zeroGradient;
    }
    baffleCyclic_half0
    {
        type            cyclic;
    }
    baffleCyclic_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
